toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
void _imgSetPowerEnabled(bool en) {
    constexpr uint16_t VDD_1V9_IMG_EN = BIT0;
    constexpr uint16_t VDD_2V8_IMG_EN = BIT2;
    if (en) {
        PADIR |=  VDD_2V8_IMG_EN|VDD_1V9_IMG_EN;
        PAOUT |=  VDD_2V8_IMG_EN;
        _delayUs(100); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V9)
        PAOUT |=  VDD_1V9_IMG_EN;
    } else {
        PADIR |=  VDD_2V8_IMG_EN|VDD_1V9_IMG_EN;
        PAOUT &= ~VDD_1V9_IMG_EN;
        // No delay needed for power down (per AR0330CS datasheet)
        PAOUT &= ~VDD_2V8_IMG_EN;
    }
}

ImgI2CStatusResp _imgI2CStatus() {
    ImgI2CStatusResp resp;
    _ice40Transfer(ImgI2CStatusMsg(), resp);
    return resp;
}

uint16_t _imgI2CRead(uint16_t addr) {
    _ice40Transfer(ImgI2CTransactionMsg(false, 2, addr, 0));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) _delayMs(1);
        const ImgI2CStatusResp status = _imgI2CStatus();
        if (status.err()) abort();
        if (status.done()) return status.readData();
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

void _imgI2CWrite(uint16_t addr, uint16_t val) {
    _ice40Transfer(ImgI2CTransactionMsg(true, 2, addr, val));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) _delayMs(1);
        const ImgI2CStatusResp status = _imgI2CStatus();
        if (status.err()) abort();
        if (status.done()) return;
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

void _imgInit() {
    _imgSetPowerEnabled(true);
    
    // Toggle IMG_RST_
    {
        _ice40Transfer(ImgResetMsg(0));
        _delayMs(1);
        _ice40Transfer(ImgResetMsg(1));
        // Wait 150k EXTCLK (16MHz) periods
        // (150e3*(1/16e6)) == 9.375ms
        _delayMs(10);
    }
    
    // Configure internal register initialization
    {
        _imgI2CWrite(0x3052, 0xA114);
    }
    
    // Start internal register initialization
    {
        _imgI2CWrite(0x304A, 0x0070);
    }
    
    // Wait 150k EXTCLK (16MHz) periods
    // (150e3*(1/16e6)) == 9.25ms
    {
        _delayMs(10);
    }
    
    // Sanity-check pix comms by reading a known register
    {
        const uint16_t chipVersion = _imgI2CRead(0x3000);
        // TODO: we probably don't want to check the version number in production, in case the version number changes?
        // also the 0x3000 isn't read-only, so in theory it could change
        Assert(chipVersion == 0x2604);
    }
}

int main() {
//    _sysInit();
//    _spiInit();
    
    // Confirm that we can communicate with the ICE40
    {
        const char str[] = "halla";
        EchoResp resp;
        _ice40Transfer(EchoMsg(str), resp);
//        Assert(!memcmp((char*)resp.payload, str, sizeof(str)));
    }
    
//    _sdInit();
    
    //_imgInit();
    
//        TestSDConfig(0, `Msg_Arg_SDInit_Clk_Speed_Off,  0, 1); // Disable SD clock, InitMode=enabled
//        TestSDConfig(0, `Msg_Arg_SDInit_Clk_Speed_Slow, 0, 1); // SD clock = slow clock, InitMode=enabled
//        // <-- Turn on power to SD card
//        TestSDConfig(0, `Msg_Arg_SDInit_Clk_Speed_Slow, 1, 1); // Trigger SDController init state machine
//        
//        // Wait 5ms
//        #5000000;
//        
//        TestSDConfig(0, `Msg_Arg_SDInit_Clk_Speed_Slow, 0, 0); // SDController InitMode=disabled
    
    for (;;);
    
    return 0;
}
